# Технічне завдання

1. Назва проєкту: Програма для безпечного віддаленого доступу до комп’ютера з використанням VPN-з’єднання.
2. Мета проєкту: Розробити програму, яка забезпечить створення безпечної віртуальної приватної мережі (VPN)для організації віддаленого доступу до пристроїв через OpenVPN. Додатково реалізувати функціонал доступу до зображення екрану, маніпуляцій курсором, терміналу та управління правами доступу в межах створених груп користувачів.
3. Мова розробки: C++ / Shell
4. Структура системи:
    1. Серверна частина
        * Запуск та налаштування OpenVPN-сервера.
        * Створення конфігурацій клієнтів.
        * Адміністрування користувачів (групи, ролі).
        * Управління сесіями (ініціалізація, завершення, підключення observer'ів).
        * Передача даних між учасниками (контроль сесій master-slave-observer).
        * Обробка запитів на віддалений доступ.
    2. Клієнтська частина
        * Ініціалізація VPN-з'єднання з сервером.
        * Відображення інформації про поточну сесію.
        * Запити на підключення до іншого користувача.
        * Погодження/відхилення запитів.
        * Залежно від ролі:
            * Master: отримання відео, передача команд курсору/введення.
            * Slave: передача зображення екрану, виконання введених команд.
            * Observer: лише отримання зображення.
        * Доступ до консолі/терміналу (при наданні дозволу).
5. Ролі користувачів:
    * Master – має повний контроль над віддаленим пристроєм.
    * Slave – пристрій, який надає доступ.
    * Observer – користувач, що лише спостерігає за сеансом.
6. Основні функції:
    1. Створення VPN-групи
        * Користувач створює групу, додає інших користувачів. (надалі цей користувач є адміністратором групи)
        * Призначає ролі.
    2. Підключення до VPN
        * Автоматичне отримання конфігурації з сервера.
        * Встановлення vpn тунелю.
    3. Запуск сесії віддаленого доступу
        * Запит від Master до Slave.
        * Погодження з боку Slave.
        * Запрошення Observer'ів до сесії (з боку Master).
    4. Робота сесії:
        * Передача відео, введення, курсору.
        * Робота з терміналом
            * Передача текстових команд та отримання результату (аналог SSH).
            * Може бути окремий режим роботи (без відео/GUI).
7. Нефункціональні вимоги:
    1. Захищена передача даних (шифрування через OpenVPN).
    2. Сумісність з Windows/Linux.
    3. Можливість масштабування (додавання нових груп, користувачів).
    4. Мінімальний інтерфейс (CLI або базовий GUI).
    5. TCP/IP протокол взаємодії.
8. Інструменти та бібліотеки:
    1. OpenVPN – основа VPN-з’єднання.
    2. Boost.Asio  – для реалізації мережевих з'єднань.
        * Реєстрація / авторизація у застосунку
        * Канал управління між клієнтом та сервером
    3. FFmpeg / OpenCV – для обробки відео потоку (екран).
    4. X11 / WinAPI – для взаємодії з курсором/введенням.
    5. CMake – збірка проєкту.
    6. Ninja – білд проєкту.
    7. Qt – для візуальної частини.
9. Очікуваний результат -- програма, яка дозволяє:
    1. Створити VPN-групу.
    2. Підключити клієнтів через OpenVPN.
    3. Надати доступ одного користувача до іншого.
    4. Передавати зображення, керувати пристроєм.
    5. Дозволяти стороннім користувачам спостерігати за сеансом.
    6. Використовувати термінал з віддаленого пристрою.
